rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c

#include "PeripheralSettingsAndMacros.h"

#include <plib.h>
#include <xc.h>
#include <time.h>
//#include <proc/p32mz2048ech144.h>

volatile int PWM1_Value = 10;
volatile int PWM2_Value = 100;

volatile int PWM1_DC = 50;
volatile int PWM2_DC = 50;

volatile int PWM1_DC_Value;
volatile int PWM2_DC_Value;


volatile int clock_scale_down = 10; // 10 fold slower execution 
volatile int clock_scale_down_count = 0; // 10 fold slower execution 

int DoAdjustPID = 0;
int DutyCyclePWM1 = 50;


BOOL    DoReadUART2 = FALSE;

int32_t     HyperADC_RX32 = 0;


BOOL IsDataReady = FALSE;


void _mon_putc(char c)
{
   U2TXREG = c;
   while (U2STAbits.UTXBF);

//   U1TXREG = c;
//   while (U1STAbits.UTXBF);
}


void InitSystem()
{
    SYSTEMConfigPerformance(SYS_FREQ);  // This function sets the PB-Div to 1. Also optimises cache for 72Mhz etc..
    mOSCSetPBDIV(OSC_PB_DIV_1);           // Therefore, configure the PB bus to run at 1/2 CPU Frequency
                                                              // you may run at PBclk of 72Mhz if you like too (omit this step)
                                                              // This will double the PWM frequency.
    

    
    mBMXDisableDRMWaitState();
    CheKseg0CacheOn();
//    mSy
//    SYSTEMConfigPB()
    INTEnableSystemMultiVectoredInt();
    
    InitUART1();
    InitUART2();
   __XC_UART = 2;
 
    InitSPI2Slave();    
    InitSPI1(32);
    
//    InitSPI1Slave();
 
}


void InitSystem_Test()
{
    SYSTEMConfigPerformance(SYS_FREQ);  // This function sets the PB-Div to 1. Also optimises cache for 72Mhz etc..
    mOSCSetPBDIV(OSC_PB_DIV_1);           // Therefore, configure the PB bus to run at 1/2 CPU Frequency
                                                              // you may run at PBclk of 72Mhz if you like too (omit this step)
                                                              // This will double the PWM frequency.
    
    INTEnableSystemMultiVectoredInt();

//    BMXDRMSZ = 0x20000;
//    BMXPFMSZ = 0x20000;

    
    /*    
//    BMXCONbits.BMXARB = 2;
    
//    BMXDKPBA = 10 * 1024;
            
//    BMXDUDBA = 0x10000;
//    BMXDUPBA = 0x10000;
    
    
//    BMXCONbits.BMXWSDRM;
    
//    mBMXSetRAMKernProgOffset(0x80000000);
//    mBMXSetFlashUserPartition(0x10000);
*/
            
       
    mBMXDisableDRMWaitState();
    CheKseg0CacheOn();

    InitUART1();
    InitUART2();    // print with UART2
    __XC_UART = 2;
 
  
    InitSPI1(128);
    InitSPI2Slave();    
    
    
    

    printf("System speed %ld Hz\n", (long) SYS_FREQ);
    printf("Peripheral clock speed %ld Hz\n", (long) GetPeripheralClock());

}


void SystemReset()
{
//    InitUART1();
//    
//    printf("Reseting system....\n");
    /* The following code illustrates a software Reset */
    // assume interrupts are disabled
    // assume the DMA controller is suspended
    // assume the device is locked
    /* perform a system unlock sequence */
    // starting critical sequence
    SYSKEY = 0x00000000; //write invalid key to force lock
    SYSKEY = 0xAA996655; //write key1 to SYSKEY
    SYSKEY = 0x556699AA; //write key2 to SYSKEY
    // OSCCON is now unlocked
    /* set SWRST bit to arm reset */
    RSWRSTSET = 1;
    /* read RSWRST register to trigger reset */
    unsigned int dummy;
    dummy = RSWRST;
    /* prevent any unwanted code execution until reset occurs*/
    
    while(1);
}


void RtccSetup()
{
    
    RtccInit();
    RtccSetup();
    
    
}


void WaitMS(unsigned int ms)
{
    unsigned int count = 0;
    unsigned int i = 0;
    
    while(count++ < ms)
    {
        i = 0;
        while(i++ < MS_LOOP)
        {
            NOP();
        }
    }
}


int InitUART1()
{
    int uart_id = 0;

//    #if defined (__32MX220F032D__) || defined (__32MX250F128D__)
// //   PPSInput(2,U2RX,RPB5); // Assign RPB5 as input pin for U2RX
// //   PPSOutput(4,RPB0,U2TX); // Set RPB0 pin as output for U2TX
//    #elif defined (__32MX430F064L__) || (__32MX450F256L__) || (__32MX470F512L__)
////    PPSInput(2,U1RX,RPF4); // Assign RPF4 as input pin for U1RX
////    PPSOutput(2,RPF5,U1TX); // Set RPF5 pin as output for U1TX
    
    PPS_Unlock();

    U1RXRbits.U1RXR = 2; // 0b0010; // RF4 input J11.46
    RPF5Rbits.RPF5R = 3; //0b0011; TX output J11.48
    
    PPS_Lock();
    
//    #endif
    uint32_t brate;
    
    brate = 115200L;
//    brate = 500000L;
    
//    brate = 460800;//921600L/2L;

//    brate = 38400L;
    
    UARTConfigure((UART_MODULE)uart_id, UART_ENABLE_PINS_TX_RX_ONLY);
    UARTSetFifoMode((UART_MODULE)uart_id,(UART_FIFO_MODE) (UART_INTERRUPT_ON_TX_NOT_FULL | UART_INTERRUPT_ON_RX_NOT_EMPTY));
    UARTSetLineControl((UART_MODULE)uart_id,(UART_LINE_CONTROL_MODE) (UART_DATA_SIZE_8_BITS | UART_PARITY_NONE | UART_STOP_BITS_1));
    UARTSetDataRate((UART_MODULE)uart_id, GetPeripheralClock(), brate);
    UARTEnable((UART_MODULE)uart_id, (UART_ENABLE_MODE) UART_ENABLE_FLAGS(UART_PERIPHERAL | UART_RX | UART_TX));

    return uart_id;
}

int InitUART2()
{
    int uart_id = 1;

//    mPORTCSetPinsDigitalIn(BIT_1 | BIT_3);
//    mPORTCSetPinsDigitalOut(BIT_2 | BIT_4);

//    mPORTCSetPinsDigitalIn(BIT_1 );
//    mPORTCSetPinsDigitalOut(BIT_4);
    
//    mPORTDSetPinsDigitalOut(BIT_11);    // U2TX  J10.15
//    mPORTDSetPinsDigitalIn(BIT_10 );    // U2RX J10.16

    mPORTASetPinsDigitalIn(BIT_14);    // U2RX J10.35
    mPORTASetPinsDigitalOut(BIT_15);    // U2TX  J10.36
    
    PPS_Unlock();

//    U2RXRbits.U2RXR = 0b1010; // 0b0010; // RC1 input J10.18
//    RPC4Rbits.RPC4R = 0b0001; // U2TX  UTX  J10.21

//    U2RXRbits.U2RXR = 0b0011; // 0b0010; // RD10 input J10.16
//    RPD11Rbits.RPD11R = 0b0001; // U2TX  UTX  J10.15

    U2RXRbits.U2RXR = 0b1101; // 0b0010; // RA14 input J10.35
    RPA15Rbits.RPA15R = 0b0001; // U2TX  UTX  J10.36
   
//    U2CTSRbits.U2CTSR = 0b1100; // RC3 .. Input  J10.20
//    RPC2Rbits.RPC2R = 0b0001; // U2RTS 0b0011; RTS output J10.19
    
    PPS_Lock();

    
    unsigned int brate;
    brate = 115200L;//115200L * 1L;
//    brate = 500000L;//115200L * 1L;

