rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    //    brate = 256000L;//115200L * 1L;
//    brate = 921600L;
    
//    U2MODEbits.BRGH = 4;
//    U2MODEbits.
 
    UARTConfigure((UART_MODULE)uart_id, UART_ENABLE_HIGH_SPEED | UART_ENABLE_PINS_TX_RX_ONLY);
    UARTSetFifoMode((UART_MODULE)uart_id,(UART_FIFO_MODE) (UART_INTERRUPT_ON_TX_NOT_FULL | UART_INTERRUPT_ON_RX_NOT_EMPTY));
    UARTSetLineControl((UART_MODULE)uart_id,(UART_LINE_CONTROL_MODE) (UART_DATA_SIZE_8_BITS | UART_PARITY_NONE | UART_STOP_BITS_1));
    UARTSetDataRate((UART_MODULE)uart_id, GetPeripheralClock(), brate);

    SetPriorityIntU2(UART_INT_PR3);
    mU2ClearAllIntFlags();
    mU2RXIntEnable(0);
//    
//    EnableIntU2RX;
//    mU2
//    mU2RXIntEnable(1);
    
    UARTEnable((UART_MODULE)uart_id, (UART_ENABLE_MODE) UART_ENABLE_FLAGS(UART_PERIPHERAL | UART_RX | UART_TX));
//    UARTEnable((UART_MODULE)uart_id, (UART_ENABLE_MODE) UART_ENABLE_FLAGS(UART_RX | UART_TX));

//    UART_PERIPHERAL
    return uart_id;
}

void MapSPI1MasterPins()
{
    printf("Mapping SPI 1 Master Pins\n");

    UnlockPPS();
 
    SDI1Rbits.SDI1R = 0b1010; //10;  // 0b1010 // RPC4  // SDI1 // J10.44
    RPD0Rbits.RPD0R = 0b1000; // // SDO1 // J10.43
    RPB2Rbits.RPB2R = 0b0111; //7; //0b0111; // SS2 // J10.47
  
    LockPPS();

    mPORTDSetPinsDigitalOut(BIT_10);// SCK1 out
    mPORTCSetPinsDigitalIn(BIT_4);// SDI1 in
    CNPDCbits.CNPDC4 = 1; // pull down

    mPORTDSetPinsDigitalOut(BIT_0);// SDO1 out 

//    mPORTDSetPinsDigitalOut(BIT_9);// SS1 out
//    mPORTDSetBits(BIT_9); // set high by default}
//    CNPDDbits.CNPDD9 = 1; // pull down

    mPORTBSetPinsDigitalOut(BIT_2);// SS1 out
    mPORTBClearBits(BIT_2); // set high by default}
    CNPUBbits.CNPUB2 = 1; // pull up
    
}

void MapSPI1SlavePins()
{
    printf("Mapping SPI 1 Slave Pins (SPI 1 Slave mode may not function properly!!)\n");

    UnlockPPS();
    
    // output pin SDO1
    RPD0Rbits.RPD0R = 0b1000; // // SDO1 // RD0 // J10.43
 
    // input pins SDI1 and SS1

    SDI1Rbits.SDI1R = 0b1010;  // 0b1010 // RPC4  // SDI1
//    SDI1Rbits.SDI1R = 0b0010;  // 0b0010 // RPF5  // SDI1 // J10.52
    SS1Rbits.SS1R = 0b1111; // RB2 // SS1 // J10.46

//    RPB2Rbits.RPB2R = 0b0111; //0b0111; // SS1
//    RPD9Rbits.RPD9R = 7; //0b0111; // SS1
//    SS1Rbits.SS1R = 0; // RPD9 input

    LockPPS();

//    TRISD
    mPORTDSetPinsDigitalIn(BIT_10);// SCK1 out J10.41
    
    // SPI1 at J10.44
    mPORTCSetPinsDigitalIn(BIT_4);// SDI1 in J10.44
    mPORTCClearBits(BIT_4);
    CNPDCbits.CNPDC4 = 1; // pull up
    
    // SDI1 at J10.52
//   
//    mPORTFSetPinsDigitalIn(BIT_5);// SDI1 in J10.52
//    mPORTFClearBits(BIT_5);
//    CNPDFbits.CNPDF5 = 1;
            
    
    mPORTDSetPinsDigitalOut(BIT_0);// SDO1 out // J10.43
//    mPORTDSetPinsDigitalIn(BIT_9);// SS1 out
//    mPORTDClearBits(BIT_9); // set high by default}
//    CNPDDbits.CNPDD9 = 1; // pull down
    
    mPORTBSetPinsDigitalIn(BIT_2);// SS1 in J10.46
    mPORTBClearBits(BIT_2); // set high by default}
//    CNPUBbits.CNPUB2 = 1;
    CNPDBbits.CNPDB2 = 1;
}


void MapSPI2MasterPins()
{
    printf("Mapping SPI 2 Master Pins\n");

    PPS_Unlock();
 
    SDI2Rbits.SDI2R = 1; // RPG7 = 0b0001 // SDI2
    RPG8Rbits.RPG8R = 6; //0b0110; // SDO2
    RPG9Rbits.RPG9R = 6; //0b0110; // SS2
    
    PPS_Lock();

    mPORTGSetPinsDigitalOut(BIT_6);// SCK2 out
    mPORTGSetPinsDigitalIn(BIT_7);// SDI2 in J10.24
    
    CNPDGbits.CNPDG7 = 1; // pull down

    mPORTGSetPinsDigitalOut(BIT_8);// SDO2 out
    mPORTGSetPinsDigitalOut(BIT_9);// SS2 out
    CNPDGbits.CNPDG9 = 1; // pull down

}


void MapSPI2SlavePins()
{
    printf("Mapping SPI 2 Slave Pins\n");

    PPS_Unlock();
 
    SDI2Rbits.SDI2R = 1; // RPG7 = 0b0001 // SDI2  SDI2 in J10.24
    RPG8Rbits.RPG8R = 6; //0b0110; // SDO2
    SS2Rbits.SS2R = 1;// RPG9 input
    
    PPS_Lock();
    
    mPORTGSetPinsDigitalIn(BIT_6);// SCK2 in J10.23
    mPORTGSetPinsDigitalIn(BIT_7);// SDI2 in J10.24
//    CNPDGbits.CNPDG7 = 1; // pull down
    mPORTGClearBits(BIT_7);
    mPORTGSetPinsDigitalOut(BIT_8);// SDO2 out
//    CNPDGbits.CNPDG7 = 1;
  
    mPORTGSetPinsDigitalIn(BIT_9);// SS2 in // RG9  // J10.26
    CNPDGbits.CNPDG9 = 1; // pull down
    mPORTGClearBits(BIT_9); // set low by default
}

//
//int SetPWMDutyCycle(float duty_cycle)
//{
//    PWM1_DC_Value = (PR2 + 1) * ((float)duty_cycle / 100.0);
//    return PWM1_DC_Value;
//}


int SetPWMDutyCycle(int pwm_number, int duty_cycle)
{
    int dval;
    if(pwm_number == 1)
    {
        OC1RS = (PR2 + 1) * ((float)duty_cycle / 100.0);    //J10.20
        return OC1RS;
    }
    
    if(pwm_number == 2)
    {
        OC2RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC2RS;
    }
    
    if(pwm_number == 3)
    {
        OC3RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC3RS;
    }

    if(pwm_number == 4)
    {
        OC4RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC4RS;
    }

    if(pwm_number == 5)
    {
        OC5RS = (PR2 + 1) * ((float)duty_cycle / 100.0);
        return OC5RS;
    }
    
}

void TurnOffPWM(int pwm_number)
{
    switch(pwm_number)
    {
        case 1:
            OC1CONbits.ON = 0;
            break;
        case 2:
            OC2CONbits.ON = 0;
            break;
        case 3:
            OC3CONbits.ON = 0;
            break;
        case 4:
            OC4CONbits.ON = 0;
            break;
        case 5:
            OC5CONbits.ON = 0;
            break;
    }
}

void TurnOnPWM(int pwm_number)
{
    switch(pwm_number)
    {
        case 1:
            OC1CONbits.ON = 1;
            break;
        case 2:
            OC2CONbits.ON = 1;
            break;
        case 3:
            OC3CONbits.ON = 1;
            break;
        case 4:
            OC4CONbits.ON = 1;
            break;
        case 5:
            OC5CONbits.ON = 1;
            break;
    }
}

void InitPWM(int pwm_frequency, int duty_cycle)
{
    int  samplerate = pwm_frequency;

    PPS_Unlock();
    RPD1Rbits.RPD1R = 0b1100; // OC1 // J11.20
//    RPD2Rbits.RPD2R = 0b1011; // OC3
    PPS_Lock();

    OC1CON = 0x0006;
    
