rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    PR2 = ((int)SYS_FREQ/ (pwm_frequency))-1;
    
    OC1RS = (PR2+1) * ((float)duty_cycle /100.0);
    
//    OC2RS = ((PR2+1) *  PWM2_DC) /(int)100;
//    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC1 module, T2 =source 
//    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC2 module, T2 =source(you could do more OCx)
//    OpenTimer2(T2_ON | T2_PS_1_256 | T2_SOURCE_INT, 0xFFFF);         // init Timer2 mode and period reg (PR2)

    T2CONbits.TCKPS = 0b101;
    
    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT2IntEnable(1);       // allow T2 int

    T2CONbits.ON = 1;
    OC1CONbits.ON = 1;
    
//    printf("PR2 == %d", PR2, OC1RS, OC2RS);

//    SetDCOC1PWM(PWM1_Value);
//    SetDCOC2PWM(PWM2_Value);

//T2_32BIT_MODE_ON

//    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
//    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
//    mT2IntEnable(1);       // allow T2 int
}



void InitPWM_v3(int pwm_frequency, int duty_cycle)
{
    int  samplerate = pwm_frequency;

    PPS_Unlock();
    RPD1Rbits.RPD1R = 0b1100; // OC1
//    RPD2Rbits.RPD2R = 0b1011; // OC3
    PPS_Lock();

    OC1CON = 0x0006;
    
    PR2 = ((int)SYS_FREQ/ (pwm_frequency*256))-1;
    
    int val = ((int)SYS_FREQ/ (pwm_frequency*1))-1;
    int dc = (PR2+1) * ((float)duty_cycle /100.0);

//    OC1RS = (PR2+1) * ((float)duty_cycle /100.0);
    
//    OC2RS = ((PR2+1) *  PWM2_DC) /(int)100;
    
    SetDCOC1PWM(dc);

    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC1 module, T2 =source 
    
//    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC2 module, T2 =source(you could do more OCx)
    OpenTimer2(T2_ON | T2_PS_1_1 | T2_SOURCE_INT, val);         // init Timer2 mode and period reg (PR2)

    
//    PR2 = ((int)SYS_FREQ/ (pwm_frequency*256))-1;
    
//    T2CONSET = 0x8000;
//    OC1CONSET = 0x8000;
    
//    printf("PR2 == %d", PR2, OC1RS, OC2RS);

//    SetDCOC1PWM(PWM1_Value);
//    SetDCOC2PWM(PWM2_Value);

//T2_32BIT_MODE_ON

    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT2IntEnable(1);       // allow T2 int
}


void InitTimer1(uint32_t freq)
{
    int freq_val = ((int)SYS_FREQ/ (freq))-1;
    
//    int correct_freq = freq * 
    
    PR1 = (uint32_t)SYS_FREQ/ ((uint32_t)(freq*( (uint32_t)128)) )-1;
    
    T1CONbits.TCKPS = 0b11; // 128
    
    mT1SetIntPriority(3);  // you don't have to use ipl3, but make sure INT definition is the same as your choice here
    mT1ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT1IntEnable(1);       // allow T2 int

    T1CONbits.ON = 1;
}



//void InitPWM()
//{
//    SetDCOC1PWM(3600);
//    
//    INTEnableSystemMultiVectoredInt();         // make separate interrupts possible
// 
//    int samplerate = 100;
// 
//    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE,0,0); // init OC1 module, T2 =source 
//    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE,0,0); // init OC2 module, T2 =source(you could do more OCx)
//    OpenTimer2(T2_ON | T2_PS_1_1 | T2_SOURCE_INT,FPB/samplerate);         // init Timer2 mode and period reg (PR2)
// 
//    PR2 = FPB/samplerate-1;
//
//    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
//    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
//    mT2IntEnable(1);       // allow T2 int
//    
//    
//}





void InitPWM_v2(int sample_rate)
{
    
    PPS_Unlock();
    RPD1Rbits.RPD1R = 0b1100; // OC1
    RPD2Rbits.RPD2R = 0b1011; // OC3
 
    PPS_Lock();
    
//    mPORT
    
    int  samplerate = sample_rate;
    int PR2 = PBUS_CLOCK/samplerate-1;

    OpenOC1(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC1 module, T2 =source 
    OpenOC2(OC_ON | OC_TIMER2_SRC | OC_PWM_FAULT_PIN_DISABLE, 0, 0); // init OC2 module, T2 =source(you could do more OCx)
    OpenTimer2(T2_ON | T2_PS_1_1 | T2_SOURCE_INT, PBUS_CLOCK/samplerate);         // init Timer2 mode and period reg (PR2)

    SetDCOC1PWM(PWM1_Value);
    SetDCOC2PWM(PWM2_Value);
    
//T2_32BIT_MODE_ON
    

    mT2SetIntPriority(7);  // you don't have to use ipl7, but make sure INT definition is the same as your choice here
    mT2ClearIntFlag();     // make sure no int will be pending until 7200 counts from this point.  
    mT2IntEnable(1);       // allow T2 int
}

void InitSPI1Slave()
{
//    printf("Mapping SPI 1 Slave Pins\n");

    MapSPI1SlavePins();
    
    
    SpiChnEnable(SPI_CHANNEL1, 0);
    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnEnable(SPI_CHANNEL1, 1);

    SPI1CONbits.ON = 1;
}


void InitSPI2Slave()
{
//    printf("Mapping SPI 2 Slave Pins\n");
    
    MapSPI2SlavePins();
    
    
    SpiChnEnable(SPI_CHANNEL2, 0);
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnEnable(SPI_CHANNEL2, 1);

    SPI2CONbits.ON = 1;

}


void InitSPI1(int baud_rate)
{
    MapSPI1MasterPins();
    
    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_MSTEN |   
                                                   SPI_CONFIG_MODE8 | SPI_CONFIG_ON
                                                   ));
    SpiChnSetBrg(SPI_CHANNEL1, baud_rate);
    SpiChnEnable(SPI_CHANNEL1, 1);
}


void InitSPI2(int baud_rate)
{
//    printf("Mapping SPI 2 Master Pins\n");
    MapSPI2MasterPins();
    
