rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSTEN |  SPI_CONFIG_MSSEN | 
                                                   SPI_CONFIG_MODE8 | SPI_CONFIG_ON |
                                                   0));
    SpiChnSetBrg(SPI_CHANNEL2, baud_rate);
    SpiChnEnable(SPI_CHANNEL2, 1);
}


void SplitFloat2Ints(float fval, int *int_val, int *frac_val)
{
    *int_val = (int) fval;

    *frac_val = (int) ( (float)(fval - (float) *int_val)*1000);
    
//    if(fval >= 0)
//    {
//        *frac_val = (int) ( (float)(fval - (float) *int_val)*1000);
//    }
//    else
//    {
//        *frac_val = (int) ( (float)(-fval + (float) *int_val)*1000);
//    }    
}



uint32_t GetDataBuffer(UART_MODULE id, char *buffer, uint32_t max_size)
{
    uint32_t num_char;

    num_char = 0;

    while(num_char < max_size)
    {
        uint8_t character;

        while(!UARTReceivedDataIsAvailable(id))
            ;
        character = UARTGetDataByte(id);
        if(character == '\r')
            break;
        *buffer = character;
        buffer++;
        num_char++;
    }

    return num_char;
}

void ReadWriteUART2()
{
    int count = 0;
    int data_rx;
    
    int max_buf0_len = 100;
    char buffer0[100];
    int idx = 0;
    
    
//    U2STAbits.URXISEL = 1;
    
//    
//    while(1)
//    {
//        
//        
//        
////        if(DoReadUART2)
//        {
//            int val = ReadUART2();
//            
//            printf("UART2 data %c\n", (char) val);
//        }
//    }
    
//    while(1)
//    {
////        while(DataRdyUART2());
////        while(DataRdyUART2()==0);
//        
//        data_rx = ReadUART2();
////        buffer0[14] = 0;
//            
////        putsUART2(buffer)
////        printf("%-3d:\t received data\t %c", count++, buffer0);
//        printf("%-3d:\t received data\t %c\n", count++, (char)data_rx);
//        
//    }
//    
    
//    UARTStartAutoDataRateDetect(1);
    
    int k = 0;
    char buffer[20];
    while(1)
    {
        
//        while(BusyUART2());
        
        k = 0;
        for(k = 0; k < 10; k++)
        {
    //        while (U2STAbits.UTXBF);
    //        U2TXREG = c;

//            if(UARTDataRateDetected(1) != 0)
            {
    //            int val =  ReadUART2(1);
//                UART_DATA val =  UARTGetData(1);
//                while(BusyUART2());
//                
//                while(DataRdyUART2());

//                while(U2STAbits. == 0);

//                while(U2STAbits.URXDA!=0);
                
                while(U2STAbits.URXDA)
                {
                    data_rx = UARTGetDataByte(1);
                    
//                    getsUART2(9, buffer0, 100);
//                    buffer0[9] = 0;
//                    printf("buffer\t %s\n",buffer0);
                    if(idx < max_buf0_len)
                    {
                        buffer0[idx] = data_rx;
                        idx++;

                    }
                    else{
                        
                        idx = 0;
                        int ix = 0;
                        for(ix = 0; ix < max_buf0_len; ix++)
                        {
                            printf("%-d:\tRead UART2 data %d\n", count++, (char)(buffer0[ix]));
                            
//                            U2TXREG = 'M';
//                            while(U2STAbits.UTXBF);
                        }
                        
                    }
                }
            }
        }
        
//        buffer[k]  = 0;

//        printf("%-d:\tRead UART2 data %c\n", count++, data_rx);
        
//        int ix;
//        for(ix = 0; ix < 1; ix++)
//        {
//            while(BusyUART2());
//
////            WriteUART2('V');
//            U2TXREG = 'M';
//            while(U2STAbits.UTXBF);
//
//        }
        
//        printf("%-d:\tRead UART2 data %c\n", count++, (char) val.data8bit);
//                printf("%-d:\tRead UART2 data %c\n", count++, (char) val);

//        WaitMS(1);

    }
    
    
}

BOOL IsDataWaitingUART2()
{
    return U2STAbits.URXDA != 0;
}

BOOL ReadCommandFromUART2(int *command, int length)
{
    /*
     Command is always 3 bytes of information
     * byte 1 : target ID
     * byte 2: 1-> write 0 Read
     * byte 3: byte to be written
     */
    
    int idx = 0;
    
    int k;
    while(U2STAbits.URXDA && (idx < length))
    {
        int val = (int) UARTGetDataByte(1);
        command[idx] = (char) val;
        idx++;
        k = 0; while(k++ < 1000);
        
        printf("Command received %d\n", val);
    }
    
//    U2STAbits.URXDA = 0;
    
    
    int count  = 0;
    if(command[0] > 0 && (command[1] == 0 || command[1] == 1) && idx >= 3)
    {
//        printf("******************************* Sending Acknowledgment ***************************\n");
        
        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1 , 0xAA);
//        UARTSendDataByte(1 , 0xAA);
//            WRITE_TO_UART2(0xAA);
//        WRITE_TO_UART2(command[1]);
//        WRITE_TO_UART2(command[2]);
//        
        
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[0]);
//
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[1]);
//
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[2]);
     
        
        return TRUE;
    }
    
    return FALSE;
}


BOOL ReadCommandFromUART1(int *command, int length)
{
    /*
     Command is always 3 bytes of information
     * byte 1 : target ID
     * byte 2: 1-> write 0 Read
     * byte 3: byte to be written
     */
    
    int idx = 0;
    
    int k;
    
    if(!U1STAbits.URXDA)
    {
        return FALSE;
    }
    
    while(U1STAbits.URXDA && (idx < length))
    {
        int val = (int) UARTGetDataByte(0);
        command[idx] = (char) val;
        idx++;
        k = 0; while(k++ < 1000);
        
        printf("Command received %d\n", val);
    }
    
