rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
//    U2STAbits.URXDA = 0;
    
    
    int count  = 0;
    if(command[0] > 0 && (command[1] == 0 || command[1] == 1) && idx >= 3)
    {
//        printf("******************************* Sending Acknowledgment ***************************\n");
        
        while(UARTTransmitterIsReady(0) == FALSE);
        return TRUE;
    }
    
    return FALSE;
}

BOOL ReadCommandFromSPI2Slave(int *command, int length)
{
    /*
     Command is always 3 bytes of information
     * byte 1 : target ID
     * byte 2: 1-> write 0 Read
     * byte 3: byte to be written
     */
    
    int idx = 0;
    int dummy = 0;
    
    int k;
    if(SPI2STATbits.SPIRBF)
    {
        while(SPI2STATbits.SPIRBF && (idx < length))
        {
            printf("Reading spi command....\n");
            
            int val = SPI2_SLAVE_READ();
            SPI2_SLAVE_WRITE(val, dummy);
            
            command[idx] = (char) val;
            idx++;
            k = 0; while(k++ < 1000);

            printf("Commane received %d\n", val);
        }
    }
    
//    U2STAbits.URXDA = 0;
    
    
    int count  = 0;
    if(command[0] > 0 && (command[1] == 0 || command[1] == 1) && idx >= 3)
    {
//        printf("******************************* Sending Acknowledgment ***************************\n");
        
        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1 , 0xAA);
//        UARTSendDataByte(1 , 0xAA);
//            WRITE_TO_UART2(0xAA);
//        WRITE_TO_UART2(command[1]);
//        WRITE_TO_UART2(command[2]);
//        
        
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[0]);
//
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[1]);
//
//        while(UARTTransmitterIsReady(1) == FALSE);
//        UARTSendDataByte(1, command[2]);
     
        
        return TRUE;
    }
    
    return FALSE;
}



// reverses a string 'str' of length 'len'
void reverse(char *str, int len)
{
    int i=0, j=len-1, temp;
    while (i<j)
    {
        temp = str[i];
        str[i] = str[j];
        str[j] = temp;
        i++; j--;
    }
}
 
 // Converts a given integer x to string str[].  d is the number
 // of digits required in output. If d is more than the number
 // of digits in x, then 0s are added at the beginning.
int intToStr(int x, char str[], int d)
{
    int istr[100];
    int i = 0;
    
    int xval = x;
    
    if(x < 0)
        x = -x;
    
//    if(x < 0)
//    {
//        str[i++] = '-';
//        x = -x;
//    }
//    
    while (x)
    {
        str[i++] = (x%10) + '0';
        x = x/10;
    }
 
    // If number of digits required is more, then
    // add 0s at the beginning
    while (i < d)
        str[i++] = '0';
 
    
    if(xval < 0)
    {
        str[i++] = '-';
    }
    
    reverse(str, i);
    str[i] = '\0';
    return i;
}
 
// Converts a floating point number to string.
void ftoa(float n, char *res, int afterpoint)
{
    // Extract integer part
    int ipart = (int)n;
 
    // Extract floating part
    float fpart;
    
    if(ipart < 0)
        fpart = (-n) - (-ipart);
    else
        fpart = n - ipart;
    
//    if(fpart < 0)
//        fpart = -fpart;
    
 
    // convert integer part to string
    int i = intToStr(ipart, res, 0);
 
    
    int order10 = 1;
    int ix = 0;
    
    while(ix++ < afterpoint)
        order10 *= 10;
    
    // check for display option after point
    if (afterpoint != 0)
    {
        res[i] = '.';  // add dot
 
        // Get the value of fraction part upto given no.
        // of points after dot. The third parameter is needed
        // to handle cases like 233.007
        fpart = fpart * order10;
 
        intToStr((int)fpart, res + i + 1, afterpoint);
    }
}



int SaveFloatDataToFlashMemory(float *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length * 2 > (0xFFFF>>1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        float val = data[idx];
        
        unsigned int ipart = (unsigned int) val;
        unsigned int fpart = 0;
        
        if(val >= 0)
        {
            fpart = (unsigned int) ((val - (int) val) * 1000.0);
        }
        else
        {
            float v2 = -val;
            fpart = (unsigned int) ((v2 - (int) v2) * 1000.0);
        }
        
        NVMWriteWord(base_address + 2*idx,  ipart);
        NVMWriteWord(base_address + (2*idx + 1),  fpart);

        idx++;
    }

    return 1;
}

int SaveInttDataToFlashMemory(unsigned int *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length > (0xFFFF>>1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        unsigned int val = data[idx];

        NVMWriteWord(base_address + idx,  val);

        idx++;
    }
    
    return 1;
}


int SaveIntFloatDataToFlashMemory(IntFloatValue *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *) BASE_DATA_ADDRESS_NVM + offset;
   
    int idx = 0;
    
    if(length > (0xFFFF >> 1) )
    {
        printf("ERROR: Buffer size must be smaller than 32K\n");
        return 0;
    }
    
    while(idx < length)
    {
        unsigned int val = data[idx].ivalue;

        NVMWriteWord(base_address + idx,  val);

        idx++;
    }
    
    return 1;
}


//int SaveIntFloatDataToFlashMemory(IntFloatValue *data, int length, unsigned int offset /* values */)
//{
//    unsigned int * base_address = (unsigned int *) BASE_DATA_ADDRESS_NVM + offset;
//   
//    int idx = 0;
//    
//    if(length > (0xFFFF >> 1) )
//    {
//        printf("ERROR: Buffer size must be smaller than 32K\n");
//        return 0;
//    }
//    
//    while(idx < length)
//    {
//        unsigned int val = data[idx].ivalue;
//
//        NVMWriteWord(base_address + idx,  val);
//
//        idx++;
//    }
//    
//    return 1;
//}

int LoadIntFloatDataFromFlashMemory(IntFloatValue *data, int length, unsigned int offset /* values */)
{
    unsigned int * base_address = (unsigned int *)BASE_DATA_ADDRESS_NVM + offset;
   
