rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
        //            if (test_buffer_length >= test_buffer_length)
        //                continue;

                i = 0;

                printf("Data Transfer started\n");

                int is_first = 1;

                while(i < test_buffer_length/2)
                {
    //                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
                    int val1  = SpiChnGetC(SPI_CHANNEL2);
                    
                    if(val1 == 0xFF)
                        break;
                    

                    SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
                    int tm = SPI2BUF;

    //                vv = 0; while(vv++ < 100);

                    int val2  = SpiChnGetC(SPI_CHANNEL2);
                    SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.lower);
                    tm = SPI2BUF;
                    
                    if(val2 == 0xFF)
                        break;

                    
                    test_buffer_length += 2;


    //                vv = 0; while(vv++ < 100);

        //            printf("upper %d   lower %d\n", (int)test_buffer[i].v.upper, (int) test_buffer[i].v.lower);
//                    printf('i == %d\n',i);
                    i++;
                }

                printf("Data Transfer finished\n");

            }
        }

//        SpiChnClose(SPI_CHANNEL2);
//            mPORTAClearBits(BIT_0 | BIT_1);
        
        free(test_buffer);
}


void Test_SPI2Slave_DataTransferWithUART1()
{
        int test_buffer_length = 200;//15480;
        UInt16Value *test_buffer = NULL;
 
        test_buffer = (UInt16Value  *) AllocateMaxPossibleMemory(&test_buffer_length);

        if(test_buffer == NULL)
        {
            printf("ERROR: Cannot allocate memory \n");
            return;
        }
//        else
//        {
//            printf("Allocated memory size %d\n", test_buffer_length);
//        }
 
        
        SpiChnEnable(SPI_CHANNEL2, 0);
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnEnable(SPI_CHANNEL2, 1);
        
        SPI2CONbits.ON = 1;

//        WaitMS(1);
        
        
//        TestUART2();
        
        
        char command[10];
        int command_length = 3;
        
        while(1)
        {
            int didx = 0;
    
            printf("Waiting for UART command....,\n");
            
            while(!U1STAbits.URXDA);
            
            if(U1STAbits.URXDA)
            {
                while(U1STAbits.URXDA && didx < 10)
                {
                    command[didx] = UARTGetDataByte(0);
                    didx++;
                }
        
                printf("Main command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                
            }
            
            if(command[0] == 99)
            {
                printf("Received command to send data by SPI2\n");
  
                command[0] = 0;
                command[1] = 0;
                command[2] = 0;
                command[3] = 0;

//                printf("command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                
                
//                if(command[0] != 99)
//                {
//                    continue;
//                }
//                printf("command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                int i =0;
                int count  = 0;

                for(i = 0; i < test_buffer_length/2; i++)
                {
                    int uval = count &0xFF00;
                    int lval = count & 0xFF;
                    test_buffer[i].v.upper = i+1;
                    test_buffer[i].v.lower = i+1+10;
                }

                UInt16Value dlen;

                dlen._value = test_buffer_length;
                
                printf("Buffer length to send %d\n", test_buffer_length);
                
                WRITE_TO_UART1(dlen.v.upper);
                WRITE_TO_UART1(dlen.v.lower);
                
                
                printf("Two bytes sent upper === %d,     lower === %d\n", (int)dlen.v.upper, (int)dlen.v.lower);
                int data_tx_count = 0;

                int vv;

        //            if (test_buffer_length >= test_buffer_length)
        //                continue;
                i = 0;

                printf("Data Transfer started\n");
                
                SendDataBySPI2Slave(test_buffer, test_buffer_length);
//                SendDataBySPI2SlaveWithTimeOut(test_buffer, test_buffer_length, (1<<10));
//
//                int is_first = 1;
//                int dummy;
//
//                while(i < test_buffer_length/2)
//                {
//    //                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
//                    int val1  = SpiChnGetC(SPI_CHANNEL2);
//
//                    SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
//                    dummy = SPI2BUF;
//
//                    if(val1 == 0xFF)
//                        break;
//
//                    int val2  = SpiChnGetC(SPI_CHANNEL2);
//                    SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.lower);
//                    dummy = SPI2BUF;
//                    
//                    if(val2 == 0xFF)
//                        break;
//
//        //            printf("upper %d   lower %d\n", (int)test_buffer[i].v.upper, (int) test_buffer[i].v.lower);
////                    printf('i == %d\n',i);
//                    i++;
//                }
//                
//                while(SPI2STATbits.SPIRBF)
//                    dummy = SPI2BUF;

                command[0] = 0;
                command[1] = 0;
                command[2] = 0;
                command[3] = 0;
                
                printf("Data Transfer finished\n");

            }
        }

//        SpiChnClose(SPI_CHANNEL2);
//            mPORTAClearBits(BIT_0 | BIT_1);
        
        free(test_buffer);
}





void Test_SPI2Slave_DataTransferWith_SPI2Command()
{
        int test_buffer_length = 100;//15480;
        UInt16Value *test_buffer = NULL;
 
