rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
        test_buffer = (UInt16Value  *) AllocateMaxPossibleMemory(&test_buffer_length);

        if(test_buffer == NULL)
        {
            printf("ERROR: Cannot allocate memory \n");
            return;
        }
//        else
//        {
//            printf("Allocated memory size %d\n", test_buffer_length);
//        }
 
        
        SpiChnEnable(SPI_CHANNEL2, 0);
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnEnable(SPI_CHANNEL2, 1);
        
        SPI2CONbits.ON = 1;

//        WaitMS(1);
        
        
//        TestUART2();
        
        printf("Waiting for UART command....,\n");
        
        char command[10];
        int command_length = 3;
        
        while(1)
        {
            int didx = 0;
            if(!SPI2STATbits.SPIRBE)
            {
                while(U2STAbits.URXDA && didx < 10)
                {
                    command[didx] = UARTGetDataByte(1);
                    didx++;
                }
        
                printf("Main command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                
            }
            
            if(command[0] == 99)
            {
  
                command[0] = 0;
                command[1] = 0;
                command[2] = 0;

//                printf("command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                
                
//                if(command[0] != 99)
//                {
//                    continue;
//                }

                
//                printf("command received.... %d, %d, %d\n", (int)command[0], (int)command[1], (int)command[2] );
                int i =0;
                int count  = 0;

                for(i = 0; i < test_buffer_length/2; i++)
                {
                    int uval = count &0xFF00;
                    int lval = count & 0xFF;
                    test_buffer[i].v.upper = i;
                    test_buffer[i].v.lower = i+10;

                }

                UInt16Value dlen;

                dlen._value = test_buffer_length;
                
                printf("Buffer length to send %d\n", test_buffer_length);
                

                WRITE_TO_UART2(dlen.v.upper);
                WRITE_TO_UART2(dlen.v.lower);
                
                
                printf("Two bytes sent upper === %d,     lower === %d\n", dlen.v.upper, dlen.v.lower);
                
//                continue;
                
                int data_tx_count = 0;

                int vv;

        //            if (test_buffer_length >= test_buffer_length)
        //                continue;

                i = 0;

                printf("Data Transfer started\n");

                int is_first = 1;

                while(i < test_buffer_length/2)
                {
    //                SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
                    int val1  = SpiChnGetC(SPI_CHANNEL2);
                    
                    if(val1 == 0xFF)
                        break;
                    

                    SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.upper);
                    int tm = SPI2BUF;

    //                vv = 0; while(vv++ < 100);

                    int val2  = SpiChnGetC(SPI_CHANNEL2);
                    SpiChnPutC(SPI_CHANNEL2, test_buffer[i].v.lower);
                    tm = SPI2BUF;
                    
                    if(val2 == 0xFF)
                        break;
                    
                    test_buffer_length += 2;


    //                vv = 0; while(vv++ < 100);

        //            printf("upper %d   lower %d\n", (int)test_buffer[i].v.upper, (int) test_buffer[i].v.lower);
//                    printf('i == %d\n',i);
                    i++;
                }

                printf("Data Transfer finished\n");

            }
        }

//        SpiChnClose(SPI_CHANNEL2);
//            mPORTAClearBits(BIT_0 | BIT_1);
        
        free(test_buffer);
}


int SendDataBySPI2Slave(UInt16Value *data, int data_length_in_bytes)
{
    int i = 0;
    int word_len = data_length_in_bytes >> 1;
    
    int val, dummy;

    printf("Sending %d bytes of data\n", data_length_in_bytes);

    int wait_count = 0;
    int do_stop_waiting = 0;
    
    for(i = 0; i < word_len; i++)
    {
        val = SpiChnGetC(SPI_CHANNEL2);
        SpiChnPutC(SPI_CHANNEL2, (unsigned int)data[i].v.upper);
        dummy = SPI2BUF;
        
        if(val == 0xFF)
        {
            break;
        }
        
        val = SpiChnGetC(SPI_CHANNEL2);
        SpiChnPutC(SPI_CHANNEL2, (unsigned int) data[i].v.lower);
        dummy = SPI2BUF;
        
        if(val == 0xFF)
        {
            break;
        }
    }

    printf("***  %d bytes SENT  ***\n", i*2);

    while(SPI2STATbits.SPIRBF) // clean up read buffer
    {
        dummy = SPI2BUF;
    }
    
    
    // it seems to help... flushes all the states,... not sure why is it even necessary
    SPI2CONbits.ON = 0;
//    WaitMS(10);
    SPI2CONbits.ON = 1;
    
    return i*2;
}


inline BOOL SPI2SlaveReadWithTimeOut(int *data, int time_out_loop)
{
    int wait_count = 0;
    while(!SPI2STATbits.SPITBF)
    {
        if(wait_count++ > time_out_loop)
        {
            return FALSE; // timeout
        }
    }
    
    *data = SPI2BUF;
    return TRUE; // Normal read
}


int SendDataBySPI2SlaveWithTimeOut(UInt16Value *data, int data_length_in_bytes, int time_out_delay)
{
    int i = 0;
    int word_len = data_length_in_bytes >> 1;
    
    int val, dummy;

    printf("Sending %d bytes of data\n", data_length_in_bytes);

    int wait_count = 0;
    BOOL do_stop_waiting = FALSE;
    
//    int time_out_delay = 10000;
    
    for(i = 0; i < word_len; i++)
    {
        if(SPI2SlaveReadWithTimeOut(&val, time_out_delay) == FALSE)
        {
            break;
        }

        SPI2BUF = data[i].v.upper;
        while(SPI2STATbits.SPITBF);
        dummy = SPI2BUF;
        
        if(val == 0xFF)
        {
            break;
        }
        
