rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
        if(SPI2SlaveReadWithTimeOut(&val, time_out_delay) == FALSE)
        {
            break;
        }

        SPI2BUF = data[i].v.lower;
        while(SPI2STATbits.SPITBF);
        dummy = SPI2BUF;
        
        if(val == 0xFF)
        {
            break;
        }
    }

    printf("***  %d bytes SENT  ***\n", i*2);

    while(SPI2STATbits.SPIRBF) // clean up read buffer
    {
        dummy = SPI2BUF;
    }
    
    
    // it seems to help... flushes all the states,... not sure why is it even necessary
    SPI2CONbits.ON = 0;
//    WaitMS(10);
    SPI2CONbits.ON = 1;
    
    return i*2;
}



void TestUART2()
{
    int count = 0;
    int tx = 50;

    printf("Reading UART2...\n");
//    InitUART2();
    
    while(1)
    {
        if(U2STAbits.URXDA)
        {
            int val = (int) UARTGetDataByte(1); // UART2
            
//            printf("%d:   UART2 read value %d\n", count++, val);

//            printf("%d:   Writing to UART2 %d\n", (int) tx);
            
            WRITE_TO_UART2(tx);
            
            tx += 15;
            tx %= 256;
        }
    }
}



void TestUART1DataReadWrite()
{
   int count = 0;
    int tx = 10;

    while(1)
    {
//        printf("%d:\tThis is a test...\n", count++);
//        
//        int k = 0; while(k++ < 1000)
//        {
//            asm("nop");
//        }
        
        
        if(U1STAbits.URXDA)
        {
            int val = (int) UARTGetDataByte(0); // UART2
            
//            printf("%d:   Writing to UART1 %d\n", (int) tx);
            
            tx = val;
            WRITE_TO_UART1(tx);
            printf("%d:   UART1 read value %d \t Writing to UART1 %d\n", count++, val, (int)tx);
            
            tx += 15;
            tx %= 256;
            
            int kk = 0; while(kk++ < (1<< 20));
        }

        
    }
}



void TestSPi2Slave()
{
    
    
        SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN|  SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_CKE_REV | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_MSSEN |SPI_CONFIG_SSEN |  SPI_CONFIG_MODE8 | SPI_CONFIG_CKE_REV | SPI_CONFIG_CKP_HIGH | SPI_CONFIG_DISSDO | SPI_CONFIG_ON));

//    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
        SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));

//    SpiChnSetBrg(SPI_CHANNEL2, brate);
        SpiChnEnable(SPI_CHANNEL2, 1);
        
        SPI2CONbits.ON = 1;
    
        int i = 0;
        int tmp = 0;
        int data_length = 100;
   
        
        while(1)
        {
//            SPI2CONbits.ON = 1;
            printf("Waiting to send %d bytes of data\n", data_length);
            for(i = 0; i < data_length/2; i++)
            {
                int val  = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, i+1);
                tmp = SPI2BUF;
                
                if(val == 0xFF)
                {
                    printf("val == %d, Exiting SPI2 read loop\n", val);
                    break;
                }
                
                int v = 0; while(v++ < 10);
                
                val  = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, i+1+10);
                tmp = SPI2BUF;
                
                if(val  == 0xFF)
                {
                    printf("2nd level val == %d, Exiting SPI2 read loop\n", val);
                    break;
                }

                
//                printf(" i = %d\n", i);
            }
            
//            printf("%i == d\n", i);
            
            printf("Data transfered\n");
            SPI2CONbits.ON = 0;
            WaitMS(1);
            SPI2CONbits.ON = 1;
        }

        SpiChnClose(SPI_CHANNEL2);
}

inline void SPI2CleanReadBuffer()
{
    int dummy;
    
    while(SPI2STATbits.SPIRBF)
    {
        dummy = SPI2BUF;
    }
    
    while(SPI2STATbits.SPITBF)
    {
        NOP();
    }
//    {
//        dummy = SPI2BUF;
//    }
    
    
//    SPI2CONbits.ON = 0;
//    SPI2CONbits.ON = 1;
}


void TestSPi2Slave_WithSendData()
{
    
    int             buffer_length = 138;
    UInt16Value     buffer[buffer_length/2];
    UInt16Value     tx_data_len;
    
    
    char * command[10];
    int    c_idx = 0;


    SpiChnEnable(SPI_CHANNEL2, 0);
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnEnable(SPI_CHANNEL2, 1);

    SPI2CONbits.ON = 1;

    printf("Waiting for UART command....\n");
//    
//    while(ReadCommandFromUART2(command, 3)==0)
//    {
//        if(command[0] == 99)
//        {
//            tx_data_len._value = buffer_length;
//            
//            WRITE_TO_UART2(tx_data_len.v.upper);
//            WRITE_TO_UART2(tx_data_len.v.lower);
//            WaitMS(2);
//            break;
//        }
//        
//        command[0] =0;
//        command[1] =0;
//        command[2] =0;
//        
//    }
    
    
    int k =0;
    for(k = 0; k < buffer_length/2; k++)
    {
        int v = k % 90;
        buffer[k].v.upper = v+1;
        buffer[k].v.lower = v+1+10;

//            buffer[k]._value = (uint16_t) ( ( (float)v + 0.25 * (1 % 5)) * 100.0 );
    }


    int count = 0;

    while(1)
    {
//            SPI2CONbits.ON = 1;
        printf("%d: Waiting to send %d bytes of data\n", count, buffer_length);

        int tx_len = SendDataBySPI2Slave(buffer, buffer_length);
//            printf("%i == d\n", i);

        printf("%d: Data transfered %d bytes\n", count, tx_len);
        count++;
    }

    SpiChnClose(SPI_CHANNEL2);
}


BOOL ReadCommandFromSPI2(int *command, int length)
{
    int idx = 0;
    
    while(SPI2STATbits.SPIRBF && idx < length)
    {
//        command[]
        
