rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    }
    
    return FALSE;
}


void TestSPi2Slave_WithSendData_WithSPI2Command()
{
    
    int             buffer_length = 138;
    UInt16Value     buffer[buffer_length/2];
    UInt16Value     tx_data_len;
    
    
    char * command[10];
    int    c_idx = 0;


    SpiChnEnable(SPI_CHANNEL2, 0);
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnEnable(SPI_CHANNEL2, 1);

    SPI2CONbits.ON = 1;

    printf("Waiting for command in SPI2 ....\n");
//    
//    while(ReadCommandFromUART2(command, 3)==0)
//    {
//        if(command[0] == 99)
//        {
//            tx_data_len._value = buffer_length;
//            
//            WRITE_TO_UART2(tx_data_len.v.upper);
//            WRITE_TO_UART2(tx_data_len.v.lower);
//            WaitMS(2);
//            break;
//        }
//        
//        command[0] =0;
//        command[1] =0;
//        command[2] =0;
//        
//    }
    
    
    int k =0;
    for(k = 0; k < buffer_length/2; k++)
    {
        int v = k % 90;
        buffer[k].v.upper = v+1;
        buffer[k].v.lower = v+1+10;

//            buffer[k]._value = (uint16_t) ( ( (float)v + 0.25 * (1 % 5)) * 100.0 );
    }

    int dummy;
    
    char len_data[3];
    
    while(1)
    {
        c_idx = 0;
        command[0] = 0;
        command[1] = 0;
        command[2] = 0;
        command[3] = 0;
        
        tx_data_len._value = buffer_length;
        len_data[0] = 1;
        len_data[1] = 2;//tx_data_len.v.upper;
        len_data[2] = 3;//tx_data_len.v.lower;
        
        if(!SPI2STATbits.SPIRBF)
            continue;

//        printf
        
        while(SPI2STATbits.SPIRBF && c_idx < 3)
        {
            int cdata = SPI2_SLAVE_READ();
//            SpiChnPutC(SPI_CHANNEL2, (unsigned int)len_data[c_idx]);
            SpiChnPutC(SPI_CHANNEL2, cdata);
//            SPI2_SLAVE_WRITE((unsigned int)len_data[c_idx], dummy);
            command[c_idx] = cdata;
            c_idx++;
        }
        
        SPI2CleanReadBuffer();
        
        int k =0;
        for(k =0 ; k < c_idx; k++)
        {
            printf("command %d\n", (int)command[k]);
            WaitMS(10);
        }
        
//        WaitMS(100);
        
        if(command[0] == 99 )
        {
            printf("Waiting to send %d bytes of data\n", buffer_length);

            int tx_len = SendDataBySPI2Slave(buffer, buffer_length);

            printf("Data transfered %d bytes\n", tx_len);
        }


    }

    SpiChnClose(SPI_CHANNEL2);
}


void TestSpi2CReadCommand()
{
    int max_command_len = 3;
    int idx =0;
    int dummy;
    
    int command[10];
    
    SpiChnEnable(SPI_CHANNEL2, 0);
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnEnable(SPI_CHANNEL2, 1);

    SPI2CONbits.ON = 1;

    int flag = 0;
    int buffer[300];
    
    idx = 0;
    
    
    
    int tx_val[10];
    
    tx_val[0] = 1;
    tx_val[1] = 2;
    tx_val[2] = 3;
    tx_val[3] = 4;
    tx_val[4] = 5;
    
    
    
    int i = 1;
    while(1)
    {
//        if(idx > 4)
//            idx = 0;
        
        if(!SPI2STATbits.SPIRBF)
            continue;

        while(idx < 5)
        {
            while(SPI2STATbits.SPIRBF)
            {
                int rx0 = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, tx_val[idx]);
                int dummy = SPI2BUF;
                buffer[idx] = rx0;
                
                if(rx0 == 0xFF)
                {
                    idx = 10;
                    SPI2CleanReadBuffer();
                    
                    break;
                }
                idx++;

            }
        }
        
        idx =0;
        
        int j =0;
        
        
//        SPI2CONbits.ON = 0;
////        WaitMS(100);
//        
//        while(j < 5)
//        {
//            printf("idx == %d  %d\n", j,  buffer[j]);
//            WaitMS(1);
//            j++;
//        }

         SPI2CleanReadBuffer();
       
 //
//        SPI2CONbits.ON = 1;
        
//        return
//        idx = 0;
    //        printf("%d\n", rx0);
    }
    
    while(1)
    {
//        if(SPI2STATbits.SPIRBF)
//            printf("SPI2STATbits.SPITBF is TRUE\t");
//        else
//            printf("SPI2STATbits.SPITBF is FALSE\t");
        
//        if(!SPI2STATbits.SPIRBE)
//            printf("SPI2STATbits.SPIRBE is Empty\t");
//        else
//            printf("SPI2STATbits.SPIRBE is NOT empty\t");
//
//        WaitMS(1);

        int data = SPI2_SLAVE_READ();
//        SpiChnPutC(SPI_CHANNEL2,data);
        int d2 = data+5;
        SPI2_SLAVE_WRITE(5, dummy);

        printf(" %d \n ", data);
        
//        buffer[idx] = data;
        
//        if(idx > 4)
//        {
//            int k = 0;
//            while(k < idx)
//            {
//                printf(" %d \n ", buffer[k]);
//                
//            }
//            idx = -1;
//         }
//        
//        idx++;
//        
//        if(idx > 50)
            break;
//        printf(" %d \n ", data);
        //WaitMS(1);
        
    }
    
    int j = 0;
    while(j < idx)
    {
        printf(" %d   \n", buffer[j]);
        j++;
    }
    
    return ;
    
    while(1)
    {
        idx = 0;
        
        if(1)
        {
            while(idx < max_command_len)
            {
                command[idx] = SPI2_SLAVE_READ();
                SPI2_SLAVE_WRITE(0, dummy);
                idx++;
                
                SPI2CONbits.ON = 0;
                SPI2CONbits.ON = 1;
                
            }
    
            if(idx == 3)
            {
                int k = 0;
                while(k++ < max_command_len)
                {
                    printf("  %d  ", command[k]);
                }
                printf("\n");
            }

        }
    }
    
    
}



void TestSPI1Master_To_SPI2SlaveData_Transfer(uint32_t spi_speed)
{
    int dummy = 0;

    int tx_rx_data_len = 1000;
    int tx1_len = tx_rx_data_len;
    int rx1_len = tx_rx_data_len;
    int tx2_len = tx_rx_data_len;
    int rx2_len = tx_rx_data_len;

