rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
    int tx1_buffer[tx1_len];
    int rx1_buffer[rx1_len];
    int tx2_buffer[tx2_len];
    int rx2_buffer[rx2_len];
    
    
//    InitSPI1(brate);
//    InitSPI2Slave();
    
    uint32_t brate = SpiBrgVal(SYS_FREQ, spi_speed);
    
    SpiChnEnable(SPI_CHANNEL1, 0);
    SpiChnConfigure(SPI_CHANNEL1, (SpiConfigFlags)(SPI_CONFIG_MSTEN |  SPI_CONFIG_FRMEN |
                                                   /*SPI_CONFIG_CKE_REV*/ 0 | SPI_CONFIG_MODE8 | SPI_CONFIG_ON
                                                   ));
    SpiChnSetBrg(SPI_CHANNEL1, brate);
    SpiChnEnable(SPI_CHANNEL1, 1);
    
    
    
    
    
    SpiChnEnable(SPI_CHANNEL2, 0);
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_FRMEN  |
                                                    /*SPI_CONFIG_CKE_REV*/ 0 | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
    SpiChnEnable(SPI_CHANNEL2, 1);

    SPI2CONbits.ON = 1;
    
    int tx1 = 0;
    int tx2;
    
    printf("Starting SPI1 -> SPI2 transver\n");
    
    int idx = 0;
    while(1)
    {
        idx = 0;
        while(idx < tx_rx_data_len)
        {
             tx2 = tx1 + 10;

             SpiChnPutC(SPI_CHANNEL1, tx1);

             int rx2 = SpiChnGetC(SPI_CHANNEL2);
             SpiChnPutC(SPI_CHANNEL2, tx2);
             dummy = SPI2BUF;

             int rx1 = 0;
             
//             rx1 = 0; //SpiChnGetC(SPI_CHANNEL1);
             rx1 = SpiChnGetC(SPI_CHANNEL1);
             
             tx1_buffer[idx] = tx1;
             rx1_buffer[idx] = rx1;

             tx2_buffer[idx] = tx2;
             rx2_buffer[idx] = rx2;

             tx1 = (tx1 + 1) % 200;

             idx++;

        }
        
        idx = 0;
        
        while(idx++ < tx_rx_data_len)
        {
            printf("tx1   %3d\trx2   %3d\ttx2   %3d\trx1   %3d\n", 
                                        tx1_buffer[idx],
                                        rx2_buffer[idx],
                                        tx2_buffer[idx],
                                        rx1_buffer[idx]);

            tx1_buffer[idx] = 0;
            rx1_buffer[idx] = 0;

            tx2_buffer[idx] = 0;
            rx2_buffer[idx] = 0;

            int k = 0; while(k++ < 1000);
        }
       
    }
}


void InitDMA_DMA_Spi2Slave()
{
    
    
    
    
}



void InitExtINTs()
{
    UnlockPPS();
    
    INT1Rbits.INT1R = 0b0010;   // INT1 input RB14, J10.59
    
    LockPPS();

    mPORTBSetPinsDigitalIn(BIT_14); // J11.34 INT1

    ConfigINT1(EXT_INT_ENABLE | RISING_EDGE_INT | EXT_INT_PRI_7);
    SetSubPriorityINT1(EXT_INT_SUB_PRI_0);
}


#define         HYPER_ADC_CS(val)       {LATDbits.LATD9  = val;}

void InitHyperADCPins()
{
    InitExtINTs();

//    mPORTASetPinsDigitalOut(BIT_3 | BIT_14 | BIT_15);

    mPORTDSetPinsDigitalOut(BIT_11 | BIT_8 | BIT_9); // J11... 24 25 26

    mPORTBSetPinsDigitalIn(BIT_5); // J11. 29
    mPORTBClearBits(BIT_5); // J11. 29   // SCKL SEL  = 0;
    
    mPORTDSetBits(BIT_8);  // J11.25   MultiPin High
    
    mPORTDSetBits(BIT_9); // J11.26   CS 
    

    mPORTDSetBits(BIT_11); // J11.24  Not used

    
//    mPORTBSetPinsDigitalOut(BIT_0);
    
    
//    mPORTDSetBits(BIT_10| BIT_11 | BIT_8 | BIT_9); // J11: 24 25 26
//    
//    
//    mPORTDClearBits(BIT_10); // SCLK SEL, J11: 23
//
//    mPORTBClearBits(BIT_5);
    
//    mPORTAClearBits(BIT_15); // J11.37  SCLK SEL to internal
//    
//    mPORTASetBits(BIT_14); // J11. 35for Drate0/ Fpath..... the 1 bit settings
//    
//    mPORTASetBits(BIT_3); // J11.36 SPI CS to internal
    
}

//#define HYPER_ADC_PIN_INIT()       



void TestHyperADC_SPI2Slave_Read()
{
    
    int data_length = 10000;
    int data[data_length];
    
    InitHyperADCPins();
    
    SpiChnEnable(SPI_CHANNEL2, 0);
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_SSEN | SPI_CONFIG_CKE_REV| SPI_CONFIG_MODE8 | SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)( SPI_CONFIG_CKE_REV | SPI_CONFIG_MODE32| SPI_CONFIG_ON));
//    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_FRMEN |  SPI_CONFIG_MODE32| SPI_CONFIG_ON));
    SpiChnConfigure(SPI_CHANNEL2, (SpiConfigFlags)(SPI_CONFIG_FRMEN |
                                                   SPI_CONFIG_FSP_IN |
                                                   SPI_CONFIG_CKE_REV  | 
                                                   SPI_CONFIG_CKP_HIGH |
                                                   SPI_CONFIG_MODE32   | 
                                                   SPI_CONFIG_ON |
                                                   SPI_CONFIG_DISSDO));

    SpiChnEnable(SPI_CHANNEL2, 1);

    SPI2CONbits.ON = 1;
    
    WaitMS(10);
    
    
    int idx = 0;
    int dummy = 0;
    
//    mPORTAClearBits(BIT_3);
    
    HYPER_ADC_CS(0);
    
    printf("Toggling ....\n");
    
    uint32_t data_ready_count = 0;
    
//    mPORTD
    
//    mPORTASetPinsDigitalOut(BIT_9); // J11.51
 
    
       
//    while(1)
//    {
//        if((data_ready_count++ % 10) == 0)
//            mPORTAToggleBits(BIT_9);
//        
//        if(IsDataReady)
//        {
//            printf("Data ready called %d times\n", data_ready_count);
//
//            IsDataReady = FALSE;
//        }
//    }
 

    
//    while(1)
//    {
//        if(IsDataReady)
//        {
//            if((data_ready_count++ % 10000000L) == 0)
//            {
//                printf("Data ready called %d times\n", data_ready_count);
//            }
//
//            IsDataReady = FALSE;
//        }
//    }
    
    
    
    
//    while(1)
//    {
////        HYPER_ADC_CS(0);
// 
////        mPORTBToggleBits(BIT_0);
//
////        mPORTDToggleBits(BIT_11 | BIT_8 | BIT_9); // J11... 23 24 25 26
////        mPORTBToggleBits(BIT_5);
//        WaitMS(1);
//
////        HYPER_ADC_CS(0);
//
//    }
    
    int rx1, rx2, rx3, rx4;
    
    
    printf("Reading HyperADC data\n");
    
    data_ready_count  = 0;
            
    while(1)
    {
        if(IsDataReady | 1)
        {
//            mPORTAClearBits(BIT_9);

//             if((data_ready_count++ % 10000000L) == 0)
//            {
//                printf("Data ready called %d times\n", data_ready_count);
//            }
            
//            rx1 = SPI2BUF;
//            SPI2BUF = 1;
//            rx2 = SPI2BUF;
//            SPI2BUF = 2;
//            rx3 = SPI2BUF;
//            SPI2BUF = 4;
//            rx4 = SPI2BUF;
//            SPI2BUF = 8;
            
            
//            rx1 = SpiChnGetC(SPI_CHANNEL2);
//            SpiChnPutC(SPI_CHANNEL2, 1);
//            rx2 = SpiChnGetC(SPI_CHANNEL2);
//            SpiChnPutC(SPI_CHANNEL2, 2);
//            rx3 = SpiChnGetC(SPI_CHANNEL2);
//            SpiChnPutC(SPI_CHANNEL2, 4);
                
//            mPORTASetBits(BIT_9);
            
            rx1 = SPI2BUF;
            
//            data[idx] = ((int32_t)((rx1 << 16) + (rx2 << 8) + (rx3 ))) ;
//            data[idx] = (int32_t) rx1;

            data[idx] = (int32_t) rx1;//HyperADC_RX32;;

            idx++;
            
            if(idx >= data_length)
            {
                SPI2CONbits.ON = 0;
                int j = 0;
            
                while(j < data_length)
                {
                    printf("%d:\t%X\n", j, data[j]);
                    data[j] = 0;
                    j++;
                }

