rollingstone/PIC32-Thermal-Controller/PeripheralSettingsAndMacros.c
                idx = 0;

                SPI2CONbits.ON = 1;
                SPI2CONbits.ON = 1;
                SPI2CONbits.ON = 1;
            }
            
            IsDataReady = FALSE;
        }
        
        int k = 0;

//        if(idx % data_length == 0)
//        {
//            for(k = 0; k < data_length; k++)
//            {
//                printf("%X\n", data[k]);
//            }
//            idx = 0
//        }
//    
        IsDataReady = FALSE;

    }

//    data_ready_counter  = 0;
    while(1)
    {
        if(IsDataReady)
        {
            idx = 0;
            while(idx < data_length)
            {
                rx1 = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, 1);
                rx2 = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, 2);
                rx3 = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, 4);
 
                rx4 = SpiChnGetC(SPI_CHANNEL2);
                SpiChnPutC(SPI_CHANNEL2, 8);

                data[idx] = ((int32_t)((rx1 << 24) + (rx2 << 16) + (rx3 << 8))) >> 8;

                idx++;
            }
            
            idx = 0;
            for(idx = 0; idx < data_length; idx++)
            {
                printf("%d:\t%X\n", idx, data[idx]);
            }
            IsDataReady = FALSE;
        }
    }
}




void __ISR(_EXTERNAL_1_VECTOR, IPL7SRS) __INT1Handler()
{
    HyperADC_RX32 = SPI2BUF;
//    HyperADC_RX32 = SpiChnGetC(SPI_CHANNEL2);
    
    IsDataReady = TRUE;
    
//    printf("Data Ready triggered\n");
    mINT1ClearIntFlag();

}
